const settings = {
    crystalWidth: 30,
    crystalHeight: 20,
    crystalBorderRadius1: '30%',
    crystalTypes: ['ace', 'green', 'blue', 'yellow', 'violet', 'brown', 'gold', 'gray', 'orange', 'pearl', 'zebra']
    ,maxRings: 3
    ,Radius: 40
    ,ActionCount: 500
    ,ActionSec: 200
    ,canChange: [
        [// первое кольцо
            
            [// возможные переходы между секторами первого кольца
                [5,1], [0,2], [1,3], [2,4], [3,5], [4,0]],
            [// возможные переходы с секторов первого кольца на второе
                [11,0,1,2], [1,2,3,4], [3,4,5,6], [5,6,7,8], [7,8,9,10], [9,10,11,0]],
            [// возможные переходы с секторов первого кольца на третье
            ]
        ],
        [
            [// возможные переходы с секторов второго кольца на первое
                [6,0], [0,1], [0,1], [1,2], [1,2], [2,3], [2,3], [3,4], [3,4], [4,5], [4,5], [6,0]],
            [// возможные переходы между секторами второго кольца
            //      0      1     2      3      4      5      6      7      8      9       10      11      
                [11,1], [0,2], [1,3], [2,4], [3,5], [4,6], [5,7], [6,8], [7,9], [8,10], [9,11], [10,0]],
            [// возможные переходы с секторов второго кольца на третье
            //      0       1       2           3       4       5           6         7           8           9         10          11      
                [17,0,1], [1,2,3], [2,3,4], [4,5,6], [5,6,7], [7,8,9], [8,9,10], [10,11,12], [11,12,13], [13,14,15], [14,15,16], [16,17,0]]
        ],
        [
            [// возможные переходы с секторов третьего кольца на первое
            ],

            [// возможные переходы с секторов третьего кольца на второе
            //      0     1     2       3       4     5     6       7      8     9       10     11    12     13     14      15      16       17
                [11,0], [0,1], [1,2], [1,2], [2,3], [3,4], [3,4], [4,5], [5,6], [5,6], [6,7], [7,8], [7,8], [8,9], [9,10], [9,10], [10,11], [11,0]],
            [// возможные переходы между секторами третьего кольца
                [17,1], [0,2], [1,3], [2,4], [3,5], [4,6], [5,7], [6,8], [7,9], [8,10], [9,11], [10,12], [11,13], [12,14], [13,15], [14,16], [15,17], [16,0]]
        ]
    ]
        

}

export default settings